/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   get_next_line.h                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: clyon <clyon@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/08/18 20:49:38 by clyon             #+#    #+#             */
/*   Updated: 2025/08/18 20:50:47 by clyon            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#ifndef GET_NEXT_LINE_H
# define GET_NEXT_LINE_H

//  ────── ⑅ ♡ ⑅  ──────
// My Buff
//  ───୨ৎ──── ⑅ ♡ ⑅  ────୨ৎ────
# ifndef BUFFER_SIZE
#  define BUFFER_SIZE 10
# endif

//  ────── ⑅ ♡ ⑅  ──────
// Libs
//  ───୨ৎ──── ⑅ ♡ ⑅  ────୨ৎ────
# include <unistd.h>
# include <stdlib.h>

//  ────── ⑅ ♡ ⑅  ──────
// File & management funcs //
//  ───୨ৎ──── ⑅ ♡ ⑅  ────୨ৎ────
char	*read_from_file(char *buffer2, int fd);
// ╰┈➤ 𝒓𝒆𝒂𝒅 𝒅𝒂𝒕𝒂 (𝒎𝒂𝒏𝒚 𝒄𝒉𝒂𝒓𝒂𝒄𝒕𝒆𝒓𝒔 𝒂𝒔 𝒃𝒖𝒇𝒇𝒆𝒓_𝒔𝒊𝒛𝒆)
char	*extract_line(char *buffer2);
// ╰┈➤ 𝒆𝒙𝒕𝒓𝒂𝒄𝒕 𝒕𝒉𝒆 𝒍𝒊𝒏𝒆 𝒇𝒓𝒐𝒎 𝒕𝒉𝒆 𝒓𝒆𝒂𝒅 𝒄𝒉𝒂𝒓𝒂𝒄𝒕𝒆𝒓𝒔
char	*obtain_remaining(char *buffer2);
// ╰┈➤ 𝒔𝒕𝒐𝒓𝒆𝒔 𝒕𝒉𝒆 𝒓𝒆𝒎𝒂𝒊𝒏𝒊𝒏𝒈
char	*append_buffer(char *buffer2, char *read_buffer);
// ╰┈➤ 𝒑𝒖𝒕 𝒔𝒕𝒓𝒊𝒏𝒈𝒔 𝒕𝒐𝒈𝒆𝒕𝒉𝒆𝒓

//  ────── ⑅ ♡ ⑅  ──────
//   Util funcs  //
//  ───୨ৎ──── ⑅ ♡ ⑅  ────୨ৎ────
char	*ft_strchr(const char *s, int c);
// ╰┈➤ 𝒔𝒆𝒂𝒓𝒄𝒉 𝒄𝒉𝒂𝒓𝒂𝒄𝒕𝒆𝒓 (𝒊𝒏 𝒔𝒕𝒓𝒊𝒏𝒈)
char	*ft_strjoin(char const *s1, char const *s2);
// ╰┈➤ 𝒔𝒕𝒓𝒊𝒏𝒈 𝒋𝒐𝒊𝒏
void	*ft_calloc(size_t nmeb, size_t size);
// ╰┈➤ 𝒂𝒍𝒍𝒐𝒄𝒂𝒕𝒆 𝒎𝒆𝒎𝒐𝒓𝒚
size_t	ft_strlen(const char *str);
// ╰┈➤ 𝒄𝒂𝒍𝒄𝒖𝒍𝒂𝒕𝒆 𝒔𝒕𝒓𝒊𝒏𝒈 𝒍𝒆𝒏𝒈𝒕𝒉
size_t	ft_strlcpy(char *dest, const char *src, size_t size);
// ╰┈➤ 𝒄𝒐𝒑𝒚 𝒂𝒏𝒅 𝒄𝒐𝒏𝒄𝒂𝒕𝒆𝒏𝒂𝒕𝒆 𝒔𝒕𝒓𝒊𝒏𝒈

//  ────── ⑅ ♡ ⑅  ──────
//   ℂ𝕠𝕣𝕖 𝔽𝕦𝕟𝕔𝕥𝕚𝕠𝕟   //
//  ───୨ৎ──── ⑅ ♡ ⑅  ────୨ৎ────
char	*get_next_line(int fd);
// ╰┈➤ 𝒈𝒆𝒕 𝒏𝒆𝒙𝒕 𝒍𝒊𝒏𝒆

#endif

// ૮ ˶ᵔ ᵕ ᵔ˶ ა                               ✧₊⁺✧₊ ᓚᘏᗢ